OpenFOAM-7-master/tutorials/lagrangian/reactingParcelFoam/hotBoxes/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    walls
    {
        type            kqRWallFunction;
        value           uniform 1e-5;
    }

    "(region0_to.*)"
    {
        type            kqRWallFunction;
        value           uniform 1e-05;
    }
}


// ************************************************************************* //
